In [2]:
import pandas as pd
import numpy as np

# DataFrame groupby method

## Tasks

Write your code in the python cells, following the comments, so that you output must be equal to the given

### Task 1: Find average sales for each product

Create sample DataFrame with product sales data and calculate the average sales for each product.

In [126]:
# Create sample DataFrame
rng = np.random.default_rng(seed=50)

products = ['Chair', 'Sofa', 'Table']
sales_data = {
    'Product': rng.choice(categories, 100),
    'Sales': rng.uniform(20, 600, 100)
}

sales_df = pd.DataFrame(sales_data)
sales_df

   Product       Sales
0    Table  544.684354
1    Table  130.759950
2    Table  260.368489
3    Table  262.987844
4    Table  386.581422
..     ...         ...
95    Sofa  324.280085
96   Chair  494.898594
97   Table   27.785004
98   Chair   28.874170
99    Sofa  365.286937

[100 rows x 2 columns]

In [127]:
# Calculate the average sales for each product.
grouped_sales = sales_df.groupby('Product')
grouped_sales['Sales'].mean()

Product
Chair    295.478801
Sofa     248.063787
Table    256.139309
Name: Sales, dtype: float64

### Task 2: Calculate class stats

Given a DataFrame with student scores, calculate the minimum, maximum, and average score for each class.

In [128]:
# Sample DataFrame
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [17]:
# calculate the minimum, maximum, and average score for each class.
grouped_df = df.groupby('Class')
min_scores = grouped_df['Score'].min()
max_scores = grouped_df['Score'].max()
average_scores = grouped_df['Score'].mean()
print(f'Min score per class: \n {min_scores} \n Max score per class: \n {max_scores} \n Average score per class: \n {average_scores}')

Min score per class:
 Class
Math       78
Science    88
Name: Score, dtype: int64
 Max score per class:
 Class
Math       92
Science    95
Name: Score, dtype: int64
 Average score per class:
 Class
Math       85.0
Science    91.0
Name: Score, dtype: float64

### Task 3: Count number of orders in each category

Given a DataFrame with product order data,  count the number of orders in each category.

In [28]:
# Sample DataFrame
data = {
    'OrderID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Furniture']
}
df = pd.DataFrame(data)
df

   OrderID     Category
0      101  Electronics
1      102     Clothing
2      103  Electronics
3      104     Clothing
4      105  Electronics
5      106    Furniture

In [33]:
# count the number of orders in each category.
grouped_df = df.groupby('Category')
grouped_df.size()

Category
Clothing       2
Electronics    3
Furniture      1
dtype: int64

### Tasks on drinks dataset

#### Task 0: Load [drinks.csv](https://github.com/geekcourses/JupyterNotebooksExamples/blob/master/datasets/various/drinks.csv) and show the first 5 rows

In [188]:
# load datasets
df = pd.read_csv('drinks.csv')
df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

#### Task 1: Calculate the average beer servings for each continent.

In [223]:
# your code here
groupedby_continents = df.groupby('continent')
groupedby_continents['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

#### Task 2: Which continent consumes max wine in total

In [216]:
# your code here
groupedby_continents['wine_servings'].sum().idxmax()

'EU'

#### Task 3: Identify the country with the highest beer servings within each continent.

In [256]:
# your code here

#### Task 4: Calculate the sum of all alcoholic beverage servings (beer, spirit, wine) by continent.

In [250]:
# your code here
groupedby_continents[['beer_servings', 'spirit_servings', 'wine_servings']].mean()

           beer_servings  spirit_servings  wine_servings
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

#### Task 5: Find countries where the total litres of pure alcohol is above the global average.

In [243]:
# your code here
pure_alcohol_average = df['total_litres_of_pure_alcohol'].mean()
df.loc[df['total_litres_of_pure_alcohol'] > pure_alcohol_average, ['country', 'total_litres_of_pure_alcohol']]

               country  total_litres_of_pure_alcohol
1              Albania                           4.9
3              Andorra                          12.4
4               Angola                           5.9
5    Antigua & Barbuda                           4.9
6            Argentina                           8.3
..                 ...                           ...
182     United Kingdom                          10.4
183           Tanzania                           5.7
184                USA                           8.7
185            Uruguay                           6.6
188          Venezuela                           7.7

[90 rows x 2 columns]